<?php

use yii\db\Migration;

/**
 * Class m180123_050536_insert_work_group_table
 */
class m180123_050536_insert_work_group_table extends Migration
{
    /**
     * @inheritdoc
     */
    // public function safeUp()
    // {

    // }

    // /**
    //  * @inheritdoc
    //  */
    // public function safeDown()
    // {
    //     echo "m180123_050536_insert_work_group_table cannot be reverted.\n";

    //     return false;
    // }

    
    // Use up()/down() to run migration code without a transaction.
    public function up()
    {

        /* งานก่อสร้างบ้าน */
        // $workgroup =array(
        //             ['เตรียมงาน',1], 
        //             ['เสาเข็ม',1],
        //             ['หลังคา',1], 
        //             ['โครงสร้าง',1],
        //             ['ปลวก',1], 
        //             ['ก่อ-ฉาบ',1],
        //             ['บัวและรางระบายน้ำ(ตัวบ้าน)',1], 
        //             ['ฝ้า-เพดาน',1],
        //             ['กระเบื้อง / หินแกรนิต',1], 
        //             ['สี',1],
        //             ['งานอลูมิเนียม',1], 
        //             ['ประตูไม้เทียม',1],
        //             ['ตกแต่งบันได',1], 
        //             ['laminate Vinyl บัว',1],
        //             ['ประปา / สุขาภิบาล',1], 
        //             ['ไฟฟ้า / สื่อสาร',1],
        //             ['เครื่องใช้ไฟฟ้า',1], 
        //             ['พื้นคอนกรีตรอบบ้าน',1],
        //             ['สวนรอบบ้าน',1], 
        //             ['งานเทถนน/ทางเท้า/คันหิน/รางตื้น',1],
        //             ['มิเตอร์', 1]
        //         );   


				
				
				
				
		//1		
        $workcgroup = [
                ['id' =>1,   'wg_name' => 'เตรียมงาน', 'wc_id'   => 1 ],
                ['id' => 2,  'wg_name' => 'เสาเข็ม', 'wc_id'   => 1 ],
                ['id' => 3,  'wg_name' => 'หลังคา', 'wc_id'   => 1 ],
                ['id' => 4,  'wg_name' => 'ปลวก', 'wc_id'   => 1 ], 
                ['id' => 5,  'wg_name' => 'โครงสร้างบ้าน', 'wc_id'   => 1 ],
                ['id' => 6,  'wg_name' => 'ก่อ-ฉาบ', 'wc_id'   => 1 ],
                ['id' => 7,  'wg_name' => 'บัวและรางระบายน้ำ(ตัวบ้าน)', 'wc_id'   => 1 ],
                ['id' => 8,  'wg_name' => 'ฝ้า-เพดาน', 'wc_id'   => 1 ],
                ['id' => 9,  'wg_name' => 'กระเบื้อง / หินแกรนิต', 'wc_id'   => 1 ],
                ['id' => 10, 'wg_name' => 'สีบ้าน', 'wc_id'   => 1 ],
                ['id' => 11, 'wg_name' => 'สีรั้ว', 'wc_id'   => 1 ],
                ['id' => 12, 'wg_name' => 'งานอลูมิเนียม', 'wc_id'   => 1 ],
                ['id' => 13, 'wg_name' => 'ประตูไม้เทียม', 'wc_id'   => 1 ],
                ['id' => 14, 'wg_name' => 'สุขาภิบาล / สุขภัณฑ์', 'wc_id'   => 1 ],
                ['id' => 15, 'wg_name' => 'ระบบไฟฟ้า', 'wc_id'   => 1 ],
                ['id' => 16, 'wg_name' => 'พื้นคอนกรีตรอบบ้าน', 'wc_id'   => 1 ],
                ['id' => 17, 'wg_name' => 'ตกแต่งบันได', 'wc_id'   => 1 ],
                ['id' => 18, 'wg_name' => 'สวนรอบบ้าน', 'wc_id'   => 1 ],
                ['id' => 19, 'wg_name' => 'Laminate  / Vinyl / บัว', 'wc_id'   => 1 ],
                ['id' => 20, 'wg_name' => 'มิเตอร์น้ำประปา / ไฟฟ้า', 'wc_id'   => 1 ],
        
                /* รั้วบ้าน / รั้วโครงการ */
                ['id' => 21, 'wg_name' => 'งานรั้วหล่อในที่-งานโครงสร้าง', 'wc_id'   => 2 ],
                ['id' => 22, 'wg_name' => 'งานรั้วหล่อในที่-งานก่อ / ฉาบ', 'wc_id'   => 2 ],
                ['id' => 23, 'wg_name' => 'ประตูรั้วและลูกกรงเหล็ก', 'wc_id'   => 2 ],
                ['id' => 24, 'wg_name' => 'งานรั้วสำเร็จรูป', 'wc_id'   => 2 ],

                /* งานเทถนน/ทางเท้า/คันหิน/รางตื้น /ท่อระบายน้ำ / บ่อพักน้ำ */
                ['id' => 25, 'wg_name' => 'ถนน / ทางเท้า', 'wc_id'   => 3 ],
                ['id' => 26, 'wg_name' => 'คันหิน/รางตื้น', 'wc_id'   => 3 ],
                ['id' => 27, 'wg_name' => 'ตะแกรง', 'wc_id'   => 3 ],
                ['id' => 28, 'wg_name' => 'ท่อระบายน้ำ', 'wc_id'   => 3 ],
                ['id' => 29, 'wg_name' => 'บ่อพักน้ำ', 'wc_id'   => 3 ],
                ['id' => 30, 'wg_name' => 'บ่อตรวจ', 'wc_id'   => 3 ],
                ['id' => 31, 'wg_name' => 'เครื่องใช้ไฟฟ้า', 'wc_id'   => 1 ]
        ];

        foreach($workcgroup as $wg){
            $this->insert('work_group',[
                'wg_name' => $wg['wg_name'],
                'wc_id' => $wg['wc_id']
            ]);
        }
    }

    public function down()
    {
        $this->dropTable('work_group');
    }
    
}
